 
Процедура РассчитатьСумму(Форма) Экспорт
	ТекущиеДанные = Форма.Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;	 
КонецПроцедуры

Процедура ОбновитьЦену(Форма, Объект) Экспорт
	ТекущиеДанные = Форма.Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Цена = 0;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) И ЗначениеЗаполнено(Объект.ВидЦены) Тогда
		МассивНоменклатуры = Новый Массив();
		МассивНоменклатуры.Добавить(ТекущиеДанные.Номенклатура);
		Цена = РаботаСДокументамиСервер.ПолучитьЦену(Объект.Дата, Объект.ВидЦены, МассивНоменклатуры)[0].Цена;
	КонецЕсли;
	
	ТекущиеДанные.Цена = Цена;	 
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
КонецПроцедуры

Процедура ОбновитьВсеЦены(Форма, Объект) Экспорт
	МассивНоменклатуры = Новый Массив();	
	Для Каждого Строка Из Объект.Товары Цикл
		МассивНоменклатуры.Добавить(Строка.Номенклатура);	
	КонецЦикла;
	
	ТаблицаЦен = РаботаСДокументамиСервер.ПолучитьЦену(Объект.Дата, Объект.ВидЦены, МассивНоменклатуры);
	Индекс = 0;
	Для Каждого Строка Из Объект.Товары Цикл
		Строка.Цена = ТаблицаЦен[Индекс].Цена;
		Строка.Сумма = Строка.Количество * Строка.Цена;
	КонецЦикла
КонецПроцедуры