
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаЗаказаКлиентом.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.НаправленияДвиженияДенежныхСредств.Поступление) КАК НаправлениеДвижения,
	|	ОплатаЗаказаКлиентом.БанковскийСчет КАК БанковскийСчет,
	|	ОплатаЗаказаКлиентом.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	СУММА(ОплатаЗаказаКлиентом.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ОплатаЗаказаКлиентом КАК ОплатаЗаказаКлиентом
	|ГДЕ
	|	ОплатаЗаказаКлиентом.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатаЗаказаКлиентом.СтатьяДвиженияДенежныхСредств,
	|	ОплатаЗаказаКлиентом.БанковскийСчет,
	|	ОплатаЗаказаКлиентом.Дата";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	
	Движения.ДвиженияДенежныхСредств.Загрузить(ТаблицаЗапроса);
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Заказ = ДанныеЗаполнения.Ссылка;
		Сумма = ДанныеЗаполнения.Товары.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

