
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ОбновитьВсеЦены(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ОбновитьВсеЦены(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ОбновитьЦену(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиент.РассчитатьСумму(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.РассчитатьСумму(ЭтотОбъект);
КонецПроцедуры

