
Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка.Дата КАК Период,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Ссылка.Склад КАК Склад,
	|	Товары.Ссылка.Ссылка КАК Партия,
	|	СУММА(Товары.Количество) КАК Количество,
	|	СУММА(Товары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.ПриходТовараНаСклад.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка.Дата,
	|	Товары.Номенклатура,
	|	Товары.Ссылка.Склад,
	|	Товары.Ссылка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Товары.Период КАК Период,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Склад КАК Склад,
	|	Товары.Партия КАК Партия,
	|	Товары.Количество КАК Количество,
	|	Товары.Сумма КАК Сумма
	|ИЗ
	|	Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Товары.Период КАК Период,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Склад КАК Склад,
	|	Товары.Количество КАК Свободно
	|ИЗ
	|	Товары КАК Товары";	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();

	Движения.ПартииТоваров.Загрузить(МассивРезультатов[1].Выгрузить());
	Движения.ОстаткиТоваров.Загрузить(МассивРезультатов[2].Выгрузить());
	
	Движения.ПартииТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
КонецПроцедуры
