
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка.Дата КАК Период,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Ссылка.ВидЦены КАК ВидЦены,
	|	Товары.Цена КАК Цена
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Движения.ЦеныНоменклатуры.Загрузить(РезультатЗапроса.Выгрузить());	
	Движения.ЦеныНоменклатуры.Записывать = Истина;
КонецПроцедуры
